aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx24u/register_access/iccrx/iodefine.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	BSC		(*(volatile struct st_bsc        __sfr __evenaccess *)0x81300)
#define	CAC		(*(volatile struct st_cac        __sfr __evenaccess *)0x8B000)
#define	RSCAN	(*(volatile struct st_rscan        __sfr __evenaccess *)0xA8322)
#define	RSCAN0	(*(volatile struct st_rscan0       __sfr __evenaccess *)0xA8300)
#define	CMPC0	(*(volatile struct st_cmpc       __sfr __evenaccess *)0xA0C80)
#define	CMPC1	(*(volatile struct st_cmpc       __sfr __evenaccess *)0xA0CA0)
#define	CMPC2	(*(volatile struct st_cmpc       __sfr __evenaccess *)0xA0CC0)
#define	CMPC3	(*(volatile struct st_cmpc       __sfr __evenaccess *)0xA0CE0)
#define	CMT		(*(volatile struct st_cmt        __sfr __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0       __sfr __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0       __sfr __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0       __sfr __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0       __sfr __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc        __sfr __evenaccess *)0x88280)
#define	DA		(*(volatile struct st_da         __sfr __evenaccess *)0x880C0)
#define	DOC		(*(volatile struct st_doc        __sfr __evenaccess *)0x8B080)
#define	DTC		(*(volatile struct st_dtc        __sfr __evenaccess *)0x82400)
#define	FLASH	(*(volatile struct st_flash      __sfr __evenaccess *)0x81000)
#define	FLASHCONST		(*(volatile struct st_flashconst __sfr __evenaccess *)0x7FC350)
#define	GPT		(*(volatile struct st_gpt        __sfr __evenaccess *)0xC2000)
#define	GPT0	(*(volatile struct st_gpt0       __sfr __evenaccess *)0xC2100)
#define	GPT1	(*(volatile struct st_gpt0       __sfr __evenaccess *)0xC2180)
#define	GPT2	(*(volatile struct st_gpt0       __sfr __evenaccess *)0xC2200)
#define	GPT3	(*(volatile struct st_gpt0       __sfr __evenaccess *)0xC2280)
#define	GPT01	(*(volatile struct st_gpt01      __sfr __evenaccess *)0xC2300)
#define	GPT23	(*(volatile struct st_gpt01      __sfr __evenaccess *)0xC2380)
#define	ICU		(*(volatile struct st_icu        __sfr __evenaccess *)0x87000)
#define	IWDT	(*(volatile struct st_iwdt       __sfr __evenaccess *)0x88030)
#define	MPC		(*(volatile struct st_mpc        __sfr __evenaccess *)0x8C11F)
#define	MPU		(*(volatile struct st_mpu        __sfr __evenaccess *)0x86400)
#define	MTU		(*(volatile struct st_mtu        __sfr __evenaccess *)0xC120A)
#define	MTU0	(*(volatile struct st_mtu0       __sfr __evenaccess *)0xC1290)
#define	MTU1	(*(volatile struct st_mtu1       __sfr __evenaccess *)0xC1290)
#define	MTU2	(*(volatile struct st_mtu2       __sfr __evenaccess *)0xC1292)
#define	MTU3	(*(volatile struct st_mtu3       __sfr __evenaccess *)0xC1200)
#define	MTU4	(*(volatile struct st_mtu4       __sfr __evenaccess *)0xC1200)
#define	MTU5	(*(volatile struct st_mtu5       __sfr __evenaccess *)0xC1A94)
#define	MTU6	(*(volatile struct st_mtu6       __sfr __evenaccess *)0xC1A00)
#define	MTU7	(*(volatile struct st_mtu7       __sfr __evenaccess *)0xC1A00)
#define	MTU9	(*(volatile struct st_mtu9       __sfr __evenaccess *)0xC1296)
#define	POE		(*(volatile struct st_poe        __sfr __evenaccess *)0x8C4C0)
#define	PORT0	(*(volatile struct st_port0      __sfr __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1      __sfr __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2      __sfr __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3      __sfr __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4      __sfr __evenaccess *)0x8C004)
#define	PORT5	(*(volatile struct st_port5      __sfr __evenaccess *)0x8C005)
#define	PORT6	(*(volatile struct st_port6      __sfr __evenaccess *)0x8C006)
#define	PORT7	(*(volatile struct st_port7      __sfr __evenaccess *)0x8C007)
#define	PORT8	(*(volatile struct st_port8      __sfr __evenaccess *)0x8C008)
#define	PORT9	(*(volatile struct st_port9      __sfr __evenaccess *)0x8C009)
#define	PORTA	(*(volatile struct st_porta      __sfr __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb      __sfr __evenaccess *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc      __sfr __evenaccess *)0x8C00C)
#define	PORTD	(*(volatile struct st_portd      __sfr __evenaccess *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte      __sfr __evenaccess *)0x8C00E)
#define	PORTF	(*(volatile struct st_portf      __sfr __evenaccess *)0x8C00F)
#define	PORTG	(*(volatile struct st_portg      __sfr __evenaccess *)0x8C010)
#define	RIIC0	(*(volatile struct st_riic       __sfr __evenaccess *)0x88300)
#define	RSPI0	(*(volatile struct st_rspi       __sfr __evenaccess *)0x88380)
#define	S12AD	(*(volatile struct st_s12ad      __sfr __evenaccess *)0x89000)
#define	S12AD1	(*(volatile struct st_s12ad1     __sfr __evenaccess *)0x89200)
#define	S12AD2	(*(volatile struct st_s12ad2     __sfr __evenaccess *)0x89400)
#define	SCI1	(*(volatile struct st_sci        __sfr __evenaccess *)0x8A020)
#define	SCI5	(*(volatile struct st_sci        __sfr __evenaccess *)0x8A0A0)
#define	SCI6	(*(volatile struct st_sci        __sfr __evenaccess *)0x8A0C0)
#define	SCI8	(*(volatile struct st_sci        __sfr __evenaccess *)0x8A100)
#define	SCI9	(*(volatile struct st_sci        __sfr __evenaccess *)0x8A120)
#define	SCI11	(*(volatile struct st_sci        __sfr __evenaccess *)0xD0000)
#define	SMCI1	(*(volatile struct st_smci       __sfr __evenaccess *)0x8A020)
#define	SMCI5	(*(volatile struct st_smci       __sfr __evenaccess *)0x8A0A0)
#define	SMCI6	(*(volatile struct st_smci       __sfr __evenaccess *)0x8A0C0)
#define	SMCI8	(*(volatile struct st_smci       __sfr __evenaccess *)0x8A100)
#define	SMCI9	(*(volatile struct st_smci       __sfr __evenaccess *)0x8A120)
#define	SMCI11	(*(volatile struct st_smci       __sfr __evenaccess *)0xD0000)
#define	SYSTEM	(*(volatile struct st_system     __sfr __evenaccess *)0x80000)
#define	TMR0	(*(volatile struct st_tmr0       __sfr __evenaccess *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1       __sfr __evenaccess *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0       __sfr __evenaccess *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1       __sfr __evenaccess *)0x88211)
#define	TMR4	(*(volatile struct st_tmr0       __sfr __evenaccess *)0x88220)
#define	TMR5	(*(volatile struct st_tmr1       __sfr __evenaccess *)0x88221)
#define	TMR6	(*(volatile struct st_tmr0       __sfr __evenaccess *)0x88230)
#define	TMR7	(*(volatile struct st_tmr1       __sfr __evenaccess *)0x88231)
#define	TMR01	(*(volatile struct st_tmr01      __sfr __evenaccess *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01      __sfr __evenaccess *)0x88214)
#define	TMR45	(*(volatile struct st_tmr01      __sfr __evenaccess *)0x88224)
#define	TMR67	(*(volatile struct st_tmr01      __sfr __evenaccess *)0x88234)

typedef enum enum_ir {
IR_BSC_BUSERR=16,IR_FCU_FRDYI=23,
IR_ICU_SWINT=27,
IR_CMT0_CMI0,
IR_CMT1_CMI1,
IR_CMT2_CMI2,
IR_CMT3_CMI3,
IR_CAC_FERRF,IR_CAC_MENDF,IR_CAC_OVFF,
IR_GPT_ETGIN=40,IR_GPT_ETGIP,
IR_RSPI0_SPEI0=44,IR_RSPI0_SPRI0,IR_RSPI0_SPTI0,IR_RSPI0_SPII0,
IR_GPT0_GTCIA0,IR_GPT0_GTCIB0,IR_GPT0_GTCIC0,IR_GPT0_GTCID0,IR_GPT0_GDTE0,
IR_GPT0_GTCIE0,IR_GPT0_GTCIF0,IR_GPT0_GTCIV0,IR_GPT0_GTCIU0,
IR_DOC_DOPCF=57,
IR_RSCAN_COMFRXINT=59,IR_RSCAN_RXFINT,IR_RSCAN_TXINT,IR_RSCAN_CHERRINT,IR_RSCAN_GLERRINT,
IR_ICU_IRQ0=64,IR_ICU_IRQ1,IR_ICU_IRQ2,IR_ICU_IRQ3,IR_ICU_IRQ4,IR_ICU_IRQ5,IR_ICU_IRQ6,IR_ICU_IRQ7,
IR_LVD_LVD1=88,IR_LVD_LVD2,
IR_GPT1_GTCIA1=98,IR_GPT1_GTCIB1,IR_GPT1_GTCIC1,IR_GPT1_GTCID1,
IR_S12AD_S12ADI=102,IR_S12AD_GBADI,IR_S12AD_GCADI,
IR_S12AD1_S12ADI1,IR_S12AD1_GBADI1,IR_S12AD1_GCADI1,
IR_CMPC0_CMPC0,
IR_CMPC1_CMPC1,
IR_CMPC2_CMPC2,
IR_S12AD2_S12ADI2,IR_S12AD2_GBADI2,IR_S12AD2_GCADI2,
IR_MTU0_TGIA0,IR_MTU0_TGIB0,IR_MTU0_TGIC0,IR_MTU0_TGID0,IR_MTU0_TCIV0,IR_MTU0_TGIE0,IR_MTU0_TGIF0,
IR_MTU1_TGIA1,IR_MTU1_TGIB1,IR_MTU1_TCIV1,IR_MTU1_TCIU1,
IR_MTU2_TGIA2,IR_MTU2_TGIB2,IR_MTU2_TCIV2,IR_MTU2_TCIU2,
IR_MTU3_TGIA3,IR_MTU3_TGIB3,IR_MTU3_TGIC3,IR_MTU3_TGID3,IR_MTU3_TCIV3,
IR_MTU4_TGIA4,IR_MTU4_TGIB4,IR_MTU4_TGIC4,IR_MTU4_TGID4,IR_MTU4_TCIV4,
IR_MTU5_TGIU5,IR_MTU5_TGIV5,IR_MTU5_TGIW5,
IR_MTU6_TGIA6,IR_MTU6_TGIB6,IR_MTU6_TGIC6,IR_MTU6_TGID6,IR_MTU6_TCIV6,
IR_MTU7_TGIA7=149,IR_MTU7_TGIB7,IR_MTU7_TGIC7,IR_MTU7_TGID7,IR_MTU7_TCIV7,
IR_MTU9_TGIA9=159,IR_MTU9_TGIB9,IR_MTU9_TGIC9,IR_MTU9_TGID9,IR_MTU9_TCIV9,IR_MTU9_TGIE9,IR_MTU9_TGIF9,
IR_POE_OEI1=168,IR_POE_OEI2,IR_POE_OEI3,IR_POE_OEI4,IR_POE_OEI5,
IR_CMPC3_CMPC3,
IR_TMR0_CMIA0,IR_TMR0_CMIB0,IR_TMR0_OVI0,
IR_TMR1_CMIA1,IR_TMR1_CMIB1,IR_TMR1_OVI1,
IR_TMR2_CMIA2,IR_TMR2_CMIB2,IR_TMR2_OVI2,
IR_TMR3_CMIA3,IR_TMR3_CMIB3,IR_TMR3_OVI3,
IR_TMR4_CMIA4,IR_TMR4_CMIB4,IR_TMR4_OVI4,
IR_TMR5_CMIA5,IR_TMR5_CMIB5,IR_TMR5_OVI5,
IR_TMR6_CMIA6,IR_TMR6_CMIB6,IR_TMR6_OVI6,
IR_TMR7_CMIA7,IR_TMR7_CMIB7,IR_TMR7_OVI7,
IR_GPT1_GDTE1=202,IR_GPT1_GTCIE1,IR_GPT1_GTCIF1,IR_GPT1_GTCIV1,IR_GPT1_GTCIU1,
IR_GPT2_GTCIA2,IR_GPT2_GTCIB2,IR_GPT2_GTCIC2,IR_GPT2_GTCID2,IR_GPT2_GDTE2,
IR_GPT2_GTCIE2,IR_GPT2_GTCIF2,IR_GPT2_GTCIV2,IR_GPT2_GTCIU2,
IR_GPT3_GTCIA3,IR_GPT3_GTCIB3,
IR_SCI1_ERI1,IR_SCI1_RXI1,IR_SCI1_TXI1,IR_SCI1_TEI1,
IR_SCI5_ERI5,IR_SCI5_RXI5,IR_SCI5_TXI5,IR_SCI5_TEI5,
IR_SCI6_ERI6,IR_SCI6_RXI6,IR_SCI6_TXI6,IR_SCI6_TEI6,
IR_SCI8_ERI8,IR_SCI8_RXI8,IR_SCI8_TXI8,IR_SCI8_TEI8,
IR_SCI9_ERI9,IR_SCI9_RXI9,IR_SCI9_TXI9,IR_SCI9_TEI9,
IR_GPT3_GTCIC3,IR_GPT3_GTCID3,IR_GPT3_GDTE3,
IR_GPT3_GTCIE3,IR_GPT3_GTCIF3,IR_GPT3_GTCIV3,IR_GPT3_GTCIU3,
IR_RIIC0_EEI0=246,IR_RIIC0_RXI0,IR_RIIC0_TXI0,IR_RIIC0_TEI0,
IR_SCI11_ERI11,IR_SCI11_RXI11,IR_SCI11_TXI11,IR_SCI11_TEI11
} enum_ir_t;

