aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx24u/register_access/iccrx/iodefine.h
typedef enum enum_dtce {
DTCE_ICU_SWINT=27,
DTCE_CMT0_CMI0,
DTCE_CMT1_CMI1,
DTCE_CMT2_CMI2,
DTCE_CMT3_CMI3,
DTCE_RSPI0_SPRI0=45,DTCE_RSPI0_SPTI0,
DTCE_GPT0_GTCIA0=48,DTCE_GPT0_GTCIB0,DTCE_GPT0_GTCIC0,DTCE_GPT0_GTCID0,
DTCE_GPT0_GTCIE0=53,DTCE_GPT0_GTCIF0,DTCE_GPT0_GTCIV0,DTCE_GPT0_GTCIU0,
DTCE_RSCAN_COMFRXINT=59,
DTCE_ICU_IRQ0=64,DTCE_ICU_IRQ1,DTCE_ICU_IRQ2,DTCE_ICU_IRQ3,DTCE_ICU_IRQ4,DTCE_ICU_IRQ5,DTCE_ICU_IRQ6,DTCE_ICU_IRQ7,
DTCE_GPT1_GTCIA1=98,DTCE_GPT1_GTCIB1,DTCE_GPT1_GTCIC1,DTCE_GPT1_GTCID1,
DTCE_S12AD_S12ADI=102,DTCE_S12AD_GBADI,DTCE_S12AD_GCADI,
DTCE_S12AD1_S12ADI1,DTCE_S12AD1_GBADI1,DTCE_S12AD1_GCADI1,
DTCE_CMPC0_CMPC0,
DTCE_CMPC1_CMPC1,
DTCE_CMPC2_CMPC2,
DTCE_S12AD2_S12ADI2,DTCE_S12AD2_GBADI2,DTCE_S12AD2_GCADI2,
DTCE_MTU0_TGIA0,DTCE_MTU0_TGIB0,DTCE_MTU0_TGIC0,DTCE_MTU0_TGID0,
DTCE_MTU1_TGIA1=121,DTCE_MTU1_TGIB1,
DTCE_MTU2_TGIA2=125,DTCE_MTU2_TGIB2,
DTCE_MTU3_TGIA3=129,DTCE_MTU3_TGIB3,DTCE_MTU3_TGIC3,DTCE_MTU3_TGID3,
DTCE_MTU4_TGIA4=134,DTCE_MTU4_TGIB4,DTCE_MTU4_TGIC4,DTCE_MTU4_TGID4,DTCE_MTU4_TCIV4,
DTCE_MTU5_TGIU5,DTCE_MTU5_TGIV5,DTCE_MTU5_TGIW5,
DTCE_MTU6_TGIA6,DTCE_MTU6_TGIB6,DTCE_MTU6_TGIC6,DTCE_MTU6_TGID6,
DTCE_MTU7_TGIA7=149,DTCE_MTU7_TGIB7,DTCE_MTU7_TGIC7,DTCE_MTU7_TGID7,DTCE_MTU7_TCIV7,
DTCE_MTU9_TGIA9=159,DTCE_MTU9_TGIB9,DTCE_MTU9_TGIC9,DTCE_MTU9_TGID9,
DTCE_CMPC3_CMPC3=173,
DTCE_TMR0_CMIA0,DTCE_TMR0_CMIB0,
DTCE_TMR1_CMIA1=177,DTCE_TMR1_CMIB1,
DTCE_TMR2_CMIA2=180,DTCE_TMR2_CMIB2,
DTCE_TMR3_CMIA3=183,DTCE_TMR3_CMIB3,
DTCE_TMR4_CMIA4=186,DTCE_TMR4_CMIB4,
DTCE_TMR5_CMIA5=189,DTCE_TMR5_CMIB5,
DTCE_TMR6_CMIA6=192,DTCE_TMR6_CMIB6,
DTCE_TMR7_CMIA7=195,DTCE_TMR7_CMIB7,
DTCE_GPT1_GTCIE1=203,DTCE_GPT1_GTCIF1,DTCE_GPT1_GTCIV1,DTCE_GPT1_GTCIU1,
DTCE_GPT2_GTCIA2,DTCE_GPT2_GTCIB2,DTCE_GPT2_GTCIC2,DTCE_GPT2_GTCID2,
DTCE_GPT2_GTCIE2=212,DTCE_GPT2_GTCIF2,DTCE_GPT2_GTCIV2,DTCE_GPT2_GTCIU2,
DTCE_GPT3_GTCIA3,DTCE_GPT3_GTCIB3,
DTCE_SCI1_RXI1=219,DTCE_SCI1_TXI1,
DTCE_SCI5_RXI5=223,DTCE_SCI5_TXI5,
DTCE_SCI6_RXI6=227,DTCE_SCI6_TXI6,
DTCE_SCI8_RXI8=231,DTCE_SCI8_TXI8,
DTCE_SCI9_RXI9=235,DTCE_SCI9_TXI9,
DTCE_GPT3_GTCIC3=238,DTCE_GPT3_GTCID3,
DTCE_GPT3_GTCIE3=241,DTCE_GPT3_GTCIF3,DTCE_GPT3_GTCIV3,DTCE_GPT3_GTCIU3,
DTCE_RIIC0_RXI0=247,DTCE_RIIC0_TXI0,
DTCE_SCI11_RXI11=251,DTCE_SCI11_TXI11
} enum_dtce_t;

typedef enum enum_ier {
IER_BSC_BUSERR=0x02,
IER_FCU_FRDYI=0x02,
IER_ICU_SWINT=0x03,
IER_CMT0_CMI0=0x03,
IER_CMT1_CMI1=0x03,
IER_CMT2_CMI2=0x03,
IER_CMT3_CMI3=0x03,
IER_CAC_FERRF=0x04,IER_CAC_MENDF=0x04,IER_CAC_OVFF=0x04,
IER_GPT_ETGIN=0x05,IER_GPT_ETGIP=0x05,
IER_RSPI0_SPEI0=0x05,IER_RSPI0_SPRI0=0x05,IER_RSPI0_SPTI0=0x05,IER_RSPI0_SPII0=0x05,
IER_GPT0_GTCIA0=0x06,IER_GPT0_GTCIB0=0x06,IER_GPT0_GTCIC0=0x06,IER_GPT0_GTCID0=0x06,
IER_GPT0_GDTE0=0x06,IER_GPT0_GTCIE0=0x06,IER_GPT0_GTCIF0=0x06,IER_GPT0_GTCIV0=0x06,IER_GPT0_GTCIU0=0x07,
IER_DOC_DOPCF=0x07,
IER_RSCAN_COMFRXINT=0x07,IER_RSCAN_RXFINT=0x07,IER_RSCAN_TXINT=0x07,IER_RSCAN_CHERRINT=0x07,IER_RSCAN_GLERRINT=0x07,
IER_ICU_IRQ0=0x08,IER_ICU_IRQ1=0x08,IER_ICU_IRQ2=0x08,IER_ICU_IRQ3=0x08,IER_ICU_IRQ4=0x08,IER_ICU_IRQ5=0x08,IER_ICU_IRQ6=0x08,IER_ICU_IRQ7=0x08,
IER_LVD_LVD1=0x0B,IER_LVD_LVD2=0x0B,
IER_GPT1_GTCIA1=0x0C,IER_GPT1_GTCIB1=0x0C,IER_GPT1_GTCIC1=0x0C,IER_GPT1_GTCID1=0x0C,
IER_S12AD_S12ADI=0x0C,IER_S12AD_GBADI=0x0C,IER_S12AD_GCADI=0x0D,
IER_S12AD1_S12ADI1=0x0D,IER_S12AD1_GBADI1=0x0D,IER_S12AD1_GCADI1=0x0D,
IER_CMPC0_CMPC0=0x0D,
IER_CMPC1_CMPC1=0x0D,
IER_CMPC2_CMPC2=0x0D,
IER_S12AD2_S12ADI2=0x0D,IER_S12AD2_GBADI2=0x0E,IER_S12AD2_GCADI2=0x0E,
IER_MTU0_TGIA0=0x0E,IER_MTU0_TGIB0=0x0E,IER_MTU0_TGIC0=0x0E,IER_MTU0_TGID0=0x0E,IER_MTU0_TCIV0=0x0E,IER_MTU0_TGIE0=0x0E,IER_MTU0_TGIF0=0x0F,
IER_MTU1_TGIA1=0x0F,IER_MTU1_TGIB1=0x0F,IER_MTU1_TCIV1=0x0F,IER_MTU1_TCIU1=0x0F,
IER_MTU2_TGIA2=0x0F,IER_MTU2_TGIB2=0x0F,IER_MTU2_TCIV2=0x0F,IER_MTU2_TCIU2=0x10,
IER_MTU3_TGIA3=0x10,IER_MTU3_TGIB3=0x10,IER_MTU3_TGIC3=0x10,IER_MTU3_TGID3=0x10,IER_MTU3_TCIV3=0x10,
IER_MTU4_TGIA4=0x10,IER_MTU4_TGIB4=0x10,IER_MTU4_TGIC4=0x11,IER_MTU4_TGID4=0x11,IER_MTU4_TCIV4=0x11,
IER_MTU5_TGIU5=0x11,IER_MTU5_TGIV5=0x11,IER_MTU5_TGIW5=0x11,
IER_MTU6_TGIA6=0x11,IER_MTU6_TGIB6=0x11,IER_MTU6_TGIC6=0x12,IER_MTU6_TGID6=0x12,IER_MTU6_TCIV6=0x12,
IER_MTU7_TGIA7=0x12,IER_MTU7_TGIB7=0x12,IER_MTU7_TGIC7=0x12,IER_MTU7_TGID7=0x13,IER_MTU7_TCIV7=0x13,
IER_MTU9_TGIA9=0x13,IER_MTU9_TGIB9=0x14,IER_MTU9_TGIC9=0x14,IER_MTU9_TGID9=0x14,IER_MTU9_TCIV9=0x14,IER_MTU9_TGIE9=0x14,IER_MTU9_TGIF9=0x14,
IER_POE_OEI1=0x15,IER_POE_OEI2=0x15,IER_POE_OEI3=0x15,IER_POE_OEI4=0x15,IER_POE_OEI5=0x15,
IER_CMPC3_CMPC3=0x15,
IER_TMR0_CMIA0=0x15,IER_TMR0_CMIB0=0x15,IER_TMR0_OVI0=0x16,
IER_TMR1_CMIA1=0x16,IER_TMR1_CMIB1=0x16,IER_TMR1_OVI1=0x16,
IER_TMR2_CMIA2=0x16,IER_TMR2_CMIB2=0x16,IER_TMR2_OVI2=0x16,
IER_TMR3_CMIA3=0x16,IER_TMR3_CMIB3=0x17,IER_TMR3_OVI3=0x17,
IER_TMR4_CMIA4=0x17,IER_TMR4_CMIB4=0x17,IER_TMR4_OVI4=0x17,
IER_TMR5_CMIA5=0x17,IER_TMR5_CMIB5=0x17,IER_TMR5_OVI5=0x17,
IER_TMR6_CMIA6=0x18,IER_TMR6_CMIB6=0x18,IER_TMR6_OVI6=0x18,
IER_TMR7_CMIA7=0x18,IER_TMR7_CMIB7=0x18,IER_TMR7_OVI7=0x18,
IER_GPT1_GDTE1=0x19,IER_GPT1_GTCIE1=0x19,IER_GPT1_GTCIF1=0x19,IER_GPT1_GTCIV1=0x19,IER_GPT1_GTCIU1=0x19,
IER_GPT2_GTCIA2=0x19,IER_GPT2_GTCIB2=0x1A,IER_GPT2_GTCIC2=0x1A,IER_GPT2_GTCID2=0x1A,IER_GPT2_GDTE2=0x1A,
IER_GPT2_GTCIE2=0x1A,IER_GPT2_GTCIF2=0x1A,IER_GPT2_GTCIV2=0x1A,IER_GPT2_GTCIU2=0x1A,
IER_GPT3_GTCIA3=0x1B,IER_GPT3_GTCIB3=0x1B,
IER_SCI1_ERI1=0x1B,IER_SCI1_RXI1=0x1B,IER_SCI1_TXI1=0x1B,IER_SCI1_TEI1=0x1B,
IER_SCI5_ERI5=0x1B,IER_SCI5_RXI5=0x1B,IER_SCI5_TXI5=0x1C,IER_SCI5_TEI5=0x1C,
IER_SCI6_ERI6=0x1C,IER_SCI6_RXI6=0x1C,IER_SCI6_TXI6=0x1C,IER_SCI6_TEI6=0x1C,
IER_SCI8_ERI8=0x1C,IER_SCI8_RXI8=0x1C,IER_SCI8_TXI8=0x1D,IER_SCI8_TEI8=0x1D,
IER_SCI9_ERI9=0x1D,IER_SCI9_RXI9=0x1D,IER_SCI9_TXI9=0x1D,IER_SCI9_TEI9=0x1D,
IER_GPT3_GTCIC3=0x1D,IER_GPT3_GTCID3=0x1D,IER_GPT3_GDTE3=0x1E,
IER_GPT3_GTCIE3=0x1E,IER_GPT3_GTCIF3=0x1E,IER_GPT3_GTCIV3=0x1E,IER_GPT3_GTCIU3=0x1E,
IER_RIIC0_EEI0=0x1E,IER_RIIC0_RXI0=0x1E,IER_RIIC0_TXI0=0x1F,IER_RIIC0_TEI0=0x1F,
IER_SCI11_ERI11=0x1F,IER_SCI11_RXI11=0x1F,IER_SCI11_TXI11=0x1F,IER_SCI11_TEI11=0x1F
} enum_ier_t;

typedef enum enum_ipr {
IPR_BSC_BUSERR=0,
IPR_FCU_FRDYI=2,
IPR_ICU_SWINT=3,
IPR_CMT0_CMI0=4,
IPR_CMT1_CMI1=5,
IPR_CMT2_CMI2=6,
IPR_CMT3_CMI3=7,
IPR_CAC_FERRF=32,IPR_CAC_MENDF=33,IPR_CAC_OVFF=34,
IPR_GPT_ETGIN=40,IPR_GPT_ETGIP=41,
IPR_RSPI0_SPEI0=44,IPR_RSPI0_SPRI0=44,IPR_RSPI0_SPTI0=44,IPR_RSPI0_SPII0=44,
IPR_GPT0_GTCIA0=48,IPR_GPT0_GTCIB0=49,IPR_GPT0_GTCIC0=50,IPR_GPT0_GTCID0=51,IPR_GPT0_GDTE0=52,
IPR_GPT0_GTCIE0=53,IPR_GPT0_GTCIF0=54,IPR_GPT0_GTCIV0=55,IPR_GPT0_GTCIU0=56,
IPR_DOC_DOPCF=57,
IPR_RSCAN_COMFRXINT=59,IPR_RSCAN_RXFINT=60,IPR_RSCAN_TXINT=61,IPR_RSCAN_CHERRINT=62,IPR_RSCAN_GLERRINT=63,
IPR_ICU_IRQ0=64,IPR_ICU_IRQ1=65,IPR_ICU_IRQ2=66,IPR_ICU_IRQ3=67,IPR_ICU_IRQ4=68,IPR_ICU_IRQ5=69,IPR_ICU_IRQ6=70,IPR_ICU_IRQ7=71,
IPR_LVD_LVD1=88,IPR_LVD_LVD2=89,
IPR_GPT1_GTCIA1=98,IPR_GPT1_GTCIB1=99,IPR_GPT1_GTCIC1=100,IPR_GPT1_GTCID1=101,
IPR_S12AD_S12ADI=102,IPR_S12AD_GBADI=103,IPR_S12AD_GCADI=104,
IPR_S12AD1_S12ADI1=105,IPR_S12AD1_GBADI1=106,IPR_S12AD1_GCADI1=107,
IPR_CMPC0_CMPC0=108,
IPR_CMPC1_CMPC1=109,
IPR_CMPC2_CMPC2=110,
IPR_S12AD2_S12ADI2=111,IPR_S12AD2_GBADI2=112,IPR_S12AD2_GCADI2=113,
IPR_MTU0_TGIA0=114,IPR_MTU0_TGIB0=114,IPR_MTU0_TGIC0=114,IPR_MTU0_TGID0=114,IPR_MTU0_TCIV0=118,IPR_MTU0_TGIE0=118,IPR_MTU0_TGIF0=118,
IPR_MTU1_TGIA1=121,IPR_MTU1_TGIB1=121,IPR_MTU1_TCIV1=123,IPR_MTU1_TCIU1=123,
IPR_MTU2_TGIA2=125,IPR_MTU2_TGIB2=125,IPR_MTU2_TCIV2=127,IPR_MTU2_TCIU2=127,
IPR_MTU3_TGIA3=129,IPR_MTU3_TGIB3=129,IPR_MTU3_TGIC3=129,IPR_MTU3_TGID3=129,IPR_MTU3_TCIV3=133,
IPR_MTU4_TGIA4=134,IPR_MTU4_TGIB4=134,IPR_MTU4_TGIC4=134,IPR_MTU4_TGID4=134,IPR_MTU4_TCIV4=138,
IPR_MTU5_TGIU5=139,IPR_MTU5_TGIV5=139,IPR_MTU5_TGIW5=139,
IPR_MTU6_TGIA6=142,IPR_MTU6_TGIB6=142,IPR_MTU6_TGIC6=142,IPR_MTU6_TGID6=142,IPR_MTU6_TCIV6=146,
IPR_MTU7_TGIA7=149,IPR_MTU7_TGIB7=149,IPR_MTU7_TGIC7=151,IPR_MTU7_TGID7=151,IPR_MTU7_TCIV7=153,
IPR_MTU9_TGIA9=159,IPR_MTU9_TGIB9=159,IPR_MTU9_TGIC9=159,IPR_MTU9_TGID9=159,IPR_MTU9_TCIV9=163,IPR_MTU9_TGIE9=163,IPR_MTU9_TGIF9=163,
IPR_POE_OEI1=168,IPR_POE_OEI2=168,IPR_POE_OEI3=168,IPR_POE_OEI4=168,IPR_POE_OEI5=168,
IPR_CMPC3_CMPC3=173,
IPR_TMR0_CMIA0=174,IPR_TMR0_CMIB0=174,IPR_TMR0_OVI0=174,
IPR_TMR1_CMIA1=177,IPR_TMR1_CMIB1=177,IPR_TMR1_OVI1=177,
IPR_TMR2_CMIA2=180,IPR_TMR2_CMIB2=180,IPR_TMR2_OVI2=180,
IPR_TMR3_CMIA3=183,IPR_TMR3_CMIB3=183,IPR_TMR3_OVI3=183,
IPR_TMR4_CMIA4=186,IPR_TMR4_CMIB4=186,IPR_TMR4_OVI4=186,
IPR_TMR5_CMIA5=189,IPR_TMR5_CMIB5=189,IPR_TMR5_OVI5=189,
IPR_TMR6_CMIA6=192,IPR_TMR6_CMIB6=192,IPR_TMR6_OVI6=192,
IPR_TMR7_CMIA7=195,IPR_TMR7_CMIB7=195,IPR_TMR7_OVI7=195,
IPR_GPT1_GDTE1=202,IPR_GPT1_GTCIE1=203,IPR_GPT1_GTCIF1=204,IPR_GPT1_GTCIV1=205,IPR_GPT1_GTCIU1=206,
IPR_GPT2_GTCIA2=207,IPR_GPT2_GTCIB2=208,IPR_GPT2_GTCIC2=209,IPR_GPT2_GTCID2=210,IPR_GPT2_GDTE2=211,
IPR_GPT2_GTCIE2=212,IPR_GPT2_GTCIF2=213,IPR_GPT2_GTCIV2=214,IPR_GPT2_GTCIU2=215,
IPR_GPT3_GTCIA3=216,IPR_GPT3_GTCIB3=217,
IPR_SCI1_ERI1=218,IPR_SCI1_RXI1=218,IPR_SCI1_TXI1=218,IPR_SCI1_TEI1=218,
IPR_SCI5_ERI5=222,IPR_SCI5_RXI5=222,IPR_SCI5_TXI5=222,IPR_SCI5_TEI5=222,
IPR_SCI6_ERI6=226,IPR_SCI6_RXI6=226,IPR_SCI6_TXI6=226,IPR_SCI6_TEI6=226,
IPR_SCI8_ERI8=230,IPR_SCI8_RXI8=230,IPR_SCI8_TXI8=230,IPR_SCI8_TEI8=230,
IPR_SCI9_ERI9=234,IPR_SCI9_RXI9=234,IPR_SCI9_TXI9=234,IPR_SCI9_TEI9=234,
IPR_GPT3_GTCIC3=238,IPR_GPT3_GTCID3=239,IPR_GPT3_GDTE3=240,
IPR_GPT3_GTCIE3=241,IPR_GPT3_GTCIF3=242,IPR_GPT3_GTCIV3=243,IPR_GPT3_GTCIU3=244,
IPR_RIIC0_EEI0=246,IPR_RIIC0_RXI0=247,IPR_RIIC0_TXI0=248,IPR_RIIC0_TEI0=249,
IPR_SCI11_ERI11=250,IPR_SCI11_RXI11=250,IPR_SCI11_TXI11=250,IPR_SCI11_TEI11=250,
IPR_BSC_=0,
IPR_FCU_=2,
IPR_CMT0_=4,
IPR_CMT1_=5,
IPR_CMT2_=6,
IPR_CMT3_=7,
IPR_RSPI0_=44,
IPR_DOC_=57,
IPR_CMPC0_=108,
IPR_CMPC1_=109,
IPR_CMPC2_=110,
IPR_MTU1_TGI=121,
IPR_MTU1_TCI=123,
IPR_MTU2_TGI=125,
IPR_MTU2_TCI=127,
IPR_MTU3_TGI=129,
IPR_MTU4_TGI=134,
IPR_MTU5_=139,
IPR_MTU5_TGI=139,
IPR_MTU6_TGI=142,
IPR_POE_=168,
IPR_POE_OEI=168,
IPR_CMPC3_=173,
IPR_TMR0_=174,
IPR_TMR1_=177,
IPR_TMR2_=180,
IPR_TMR3_=183,
IPR_TMR4_=186,
IPR_TMR5_=189,
IPR_TMR6_=192,
IPR_TMR7_=195,
IPR_SCI1_=218,
IPR_SCI5_=222,
IPR_SCI6_=226
} enum_ipr_t;

